Revit 2027 API
ExporterIFCUtils.GetRoofComponents Method
 Gets the components of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RoofComponents GetRoofComponents(
	ExporterIFC exporterIFC,
	RoofBase roof
)
Public Shared Function GetRoofComponents (
	exporterIFC As ExporterIFC,
	roof As RoofBase
) As RoofComponents
public:
static RoofComponents^ GetRoofComponents(
	ExporterIFC^ exporterIFC,
	RoofBase^ roof
)
static member GetRoofComponents :
        exporterIFC : ExporterIFC *
        roof : RoofBase -> RoofComponents
Parameters
exporterIFC ExporterIFC
 The exporter.
roof RoofBase
 The roof element.
Return Value
RoofComponents
 The roof components.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace